================================================================================
Universal selector
================================================================================

*

--------------------------------------------------------------------------------

(source_file
  (star))

================================================================================
Simple type filter
================================================================================

*[_type == "movie"]

--------------------------------------------------------------------------------

(source_file
  (attribute_access
    (expression
      (star))
    (binary_expression
      (expression
        (identifier))
      (expression
        (literal
          (string))))))

================================================================================
Type filter with slicing
================================================================================

*[_type == "movie"][0...10]

--------------------------------------------------------------------------------

(source_file
  (attribute_access
    (expression
      (attribute_access
        (expression
          (star))
        (binary_expression
          (expression
            (identifier))
          (expression
            (literal
              (string))))))
    (binary_expression
      (expression
        (literal
          (number)))
      (expression
        (literal
          (number))))))

================================================================================
Object wrapper
================================================================================

{
  "movies": *[_type == "movie"]
}

--------------------------------------------------------------------------------

(source_file
  (projection
    (pair
      (literal
        (string))
      (attribute_access
        (expression
          (star))
        (binary_expression
          (expression
            (identifier))
          (expression
            (literal
              (string))))))))

================================================================================
Array literal
================================================================================

["espen", 'bjÃ¸rge', "simen", "even"]

--------------------------------------------------------------------------------

(source_file
  (array
    (literal
      (string))
    (literal
      (string))
    (literal
      (string))
    (literal
      (string))))

================================================================================
Function call
================================================================================

count(*[_type == 'movie'])

--------------------------------------------------------------------------------

(source_file
  (function_call
    (identifier)
    (attribute_access
      (expression
        (star))
      (binary_expression
        (expression
          (identifier))
        (expression
          (literal
            (string)))))))

================================================================================
Pipe expression
================================================================================

*[_type == "movie"] | order(_createdAt desc)

--------------------------------------------------------------------------------

(source_file
  (pipe_expression
    (expression
      (attribute_access
        (expression
          (star))
        (binary_expression
          (expression
            (identifier))
          (expression
            (literal
              (string))))))
    (expression
      (function_call
        (order_function
          (identifier))))))

================================================================================
Reference expansion
================================================================================

author->

--------------------------------------------------------------------------------

(source_file
  (attribute_access
    (expression
      (identifier))))

================================================================================
Parent reference
================================================================================

^._id

--------------------------------------------------------------------------------

(source_file
  (attribute_access
    (expression
      (parent))
    (identifier)))

================================================================================
This reference
================================================================================

@._id

--------------------------------------------------------------------------------

(source_file
  (attribute_access
    (expression
      (this))
    (identifier)))

================================================================================
Null literal
================================================================================

null

--------------------------------------------------------------------------------

(source_file
  (literal
    (null)))

================================================================================
Boolean literals
================================================================================

true

--------------------------------------------------------------------------------

(source_file
  (literal
    (true)))

================================================================================
Number with decimal
================================================================================

7.0

--------------------------------------------------------------------------------

(source_file
  (literal
    (number)))

================================================================================
Logical operators
================================================================================

popularity > 20 && rating >= 7.0

--------------------------------------------------------------------------------

(source_file
  (binary_expression
    (expression
      (binary_expression
        (expression
          (identifier))
        (expression
          (literal
            (number)))))
    (expression
      (binary_expression
        (expression
          (identifier))
        (expression
          (literal
            (number)))))))

================================================================================
Unary not operator
================================================================================

!false

--------------------------------------------------------------------------------

(source_file
  (unary_expression
    (expression
      (literal
        (false)))))

================================================================================
In operator
================================================================================

title in ['a', "b", 'c']

--------------------------------------------------------------------------------

(source_file
  (binary_expression
    (expression
      (identifier))
    (expression
      (array
        (literal
          (string))
        (literal
          (string))
        (literal
          (string))))))

================================================================================
Modulo operator
================================================================================

index % 2 == 0

--------------------------------------------------------------------------------

(source_file
  (binary_expression
    (expression
      (binary_expression
        (expression
          (identifier))
        (expression
          (literal
            (number)))))
    (expression
      (literal
        (number)))))

================================================================================
Projection
================================================================================

{
  title,
  author->
}

--------------------------------------------------------------------------------

(source_file
  (projection
    (identifier)
    (attribute_access
      (expression
        (identifier)))))

================================================================================
Comments
================================================================================

// This is a comment
*[_type == "movie"]

--------------------------------------------------------------------------------

(source_file
  (comment)
  (attribute_access
    (expression
      (star))
    (binary_expression
      (expression
        (identifier))
      (expression
        (literal
          (string))))))
